<script setup lang="ts">

const showModal = ref(false)
</script>

<template>
  <button @click="showModal = true">弹出Modal</button>
  <YlModal :show="showModal" :show-mask="true" @close="showModal = false">
    <template v-slot:header>
      弹出框标题很长很长很长很长很长很长很长很长很长很长很长很长很长很长
    </template>
    <template v-slot:body>
      this is modal body! 对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
      对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
      对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
      对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
      对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
      对我个人而言，随机一段废话不仅仅是一个重大的事件，还可能会改变我的人生. 随机一段废话似乎是一种巧合，但如果我们从一个更大的角度看待问题，这似乎是一种不可避免的事实. 要想清楚, 随机一段废话, 到底是一种怎么样的存在. 这样看来, 一般来说, 我认为, 随机一段废话, 发生了会如何, 不发生又会如何.
      而这些并不是完全重要, 更加重要的问题是, 就我个人来说, 随机一段废话对我的意义,
    </template>
  </YlModal>
</template>

<style scoped>

</style>